tutorials/rhopSonicFoam/shockTube/system/fvSolution
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p PCG
    {
        preconditioner
        {
            type        DIC;
        }

        minIter          0;
        maxIter          2000;
        tolerance        1e-15;
        relTol           0;
    };
    rho PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-15;
        relTol           0;
    };
    rhoU PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-15;
        relTol           0;
    };
    rhoE PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-15;
        relTol           0;
    };
    rhoH PBiCG
    {
        preconditioner
        {
            type        DILU;
        }

        minIter          0;
        maxIter          500;
        tolerance        1e-15;
        relTol           0;
    };
}

PISO
{
    nOuterCorrectors 3;
    nCorrectors      1;
    HbyAblend        0.0;
}


// ************************************************************************* //
